Tekla Open API Reference for Tekla Structures 2025
Weld.WeldAttributes.Representation Property
 The representation of the weld.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Weld.Representation Representation { get; set; }
Public Property Representation As Weld.Representation
	Get
	Set
Property Value
Type: Weld.Representation
See Also
Reference
Weld.WeldAttributes Class
Tekla.Structures.Drawing Namespace